In [1]:
import pandas as pd
import sqlalchemy

In [10]:
engine = sqlalchemy.create_engine('mysql+pymysql://root:@localhost:3306/padas')

In [15]:
df = pd.read_sql_table("customers", engine, columns=['name', 'phone_number'])
df

     name phone_number
0  Donald   2456597779
1    BIll   1452368979
2    John    785214639

In [17]:
query='''
SELECT customers.name, customers.phone_number,
Orders.name, Orders.amount FROM customers 
INNER JOIN Orders ON customers.id=Orders.id
'''
df = pd.read_sql_query(query, engine)
df

     name phone_number          name  amount
0  Donald   2456597779  Google Pixel     950
1    BIll   1452368979      Yoga Mat      20
2    John    785214639  Fossil Watch     120